Repository: pauldnguyen/findingwally
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Finding Wally
fr: Trouver Charlie

source: FINDING WALLY
fr: TROUVER CHARLIE

source: More Information
fr: Plus d'Information

source: Languages
fr: Langues

source: Error 500
fr: Erreur 500

source: There is a server error. Perhaps you submitted an image address that is not compatible with the free PythonAnywhere account that hosts this Website. Please try again; images from Twitter do not cause this error.
fr: Il y a une erreur du serveur. Vous avez peut-être soumis une adresse d'image qui n'est pas compatible avec le compte PythonAnywhere gratuit hébergeant ce site Web. Veuillez réessayer&#xA0;; les images de Twitter ne provoquent pas cette erreur.

source: Where's Wally?
fr: Où est Charlie&#xA0;?

source: Wally has gone out in search of adventure again! Perhaps you have heard of him from his famous series of books <i>Where's Wally?</i> full of his many pictures from various exotic times and places. As usual, he likes to hide somewhere at each location so that his friends can have fun looking for him.
fr: Charlie est de nouveau parti à l'aventure&#xA0;! Peut-être avez-vous entendu parler de lui de sa célèbre série de livres <i>Où est Charlie&#xA0;?</i> pleine de ses nombreuses images de divers temps et lieux exotiques. Comme d'habitude, il aime se cacher quelque part à chaque endroit pour que ses amis peuvent s'amuser à le chercher.

source: That search for him is now easier than ever before with this new tool that detects him using a powerful technique from machine learning: the artificial neural network. This system is made up of a collection of connected units called artificial neurons, which are reminiscent of neurons in a brain. These artificial neurons process the data, and transfer them to the next neurons until the data reaches an output node indicating a decision. To calibrate the connections between neurons, the network trains itself by taking appropriate data through the network, and adjusting the connections to reduce errors in the final predictions. After it learns Wally's different features from images with him and those without him, this model is able to detect his location in new images.
fr: Cette recherche de lui est maintenant plus facile que jamais avec ce nouvel outil qui le détecte à l'aide d'une technique puissante de l'apprentissage automatique&#xA0;: le réseau neuronal artificiel. Ce système est constitué d'une collection d'unités connectés appelés neurones artificiels, qui rappellent les neurones dans un cerveau. Ces neurones artificiels traitent les données et les transfèrent aux neurones suivants jusqu'à ce que les données atteignent un nœud de sortie indiquant une décision. Pour calibrer les connexions entre les neurones, le réseau s'entraîne en prenant les données appropriées à travers le réseau, et en ajustant les connexions pour réduire les erreurs dans les prédictions finales. Après avoir appris les différentes caractéristiques de Charlie à partir d'images avec lui et celles sans lui, ce modèle est capable de détecter son emplacement dans de nouvelles images.

source: Give it a try now: look through the collection of images below, and select one to start finding Wally! If you do not see any images, try opening the website in another browser.
fr: Essayez-le maintenant&#xA0;: parcourez la collection d'images ci-dessous et sélectionnez-en une pour commencer à trouver Charlie&#xA0;! Si vous ne voyez aucune image, essayez d'ouvrir le site Web dans un autre navigateur.

source: If no images appear, try opening the website in another browser.
fr: Si aucune image n'apparaît, essayez d'ouvrir le site Web dans un autre navigateur.

source: FIND WALLY
fr: TROUVER CHARLIE

source: Find Wally in the image
fr: Trouver Charlie dans l'image

source: Once you have selected an image from the collection, click on the button above to find Wally. You can also add more images from the Internet by typing its address in the box below and clicking the button on the side. Afterwards, you can select that image just like any of the others in the collection to find Wally. Because of the restrictions of using a free account with the PythonAnywhere web-hosting service, you can only add certain external sources such as Twitter. You may find some good new images to try from Wally's Twitter below.
fr: Une fois que vous avez sélectionné une image de la collection, cliquez sur le bouton ci-dessus pour trouver Charlie. Vous pouvez également ajouter plus d'images sur Internet en tapant son adresse dans la case ci-dessous et en cliquant sur le bouton sur le côté. Ensuite, vous pouvez sélectionner cette image comme n'importe laquelle des autres dans la collection pour trouver Charlie. En raison des restrictions d'utilisation d'un compte gratuit avec le service d'hébergement Web PythonAnywhere, vous pouvez uniquement ajouter certaines sources externes telles que Twitter. Vous pouvez trouver de bonnes nouvelles images à essayer de la page Twitter de Charlie ci-dessous.

source: Enter the web address of an image here.
fr: Entrez l'adresse Web d'une image ici.

source: Add the image
fr: Ajouter l'image

source: This calculation may take around a minute. Can you find Wally before that?
fr: Ce calcul peut prendre environ une minute. Pouvez-vous trouver Charlie avant ça&#xA0;?

source: Here is a closer look. Try going back and clicking the <i>FIND WALLY</i> button.
fr: Voici un peu plus près. Essayez de retourner et de cliquer sur le bouton <i>TROUVER CHARLIE</i>.

source: Here&apos;s Wally!
fr: Voici Charlie&#xA0;!

source: Perhaps Wally is not here...
fr: Peut-être que Chalie n'est pas là...

source: Hello, World!
fr: Bonjour le monde&#xA0;!

source: Thanks for visiting and trying my little Web application! I hope you liked it.
fr: Merci de votre visite et d'essayer ma petite application Web&#xA0;! J'espère que vous l'avez aimé.

source: After seeing the capabilities of machine learning in this example, you may be curious about how it works, and want to learn more. The specific model used in this application is called a convolutional neural network. This type of artificial neural network is commonly used for analysis on images, but it can also be used in other situations.
fr: Après avoir vu les capacités de l'apprentissage automatique dans cet exemple, vous pouvez être curieux de savoir comment ça fonctionne, et vous voulez en savoir plus. Le modèle spécifique utilisé dans cette application est appelé un réseau de neurones convolutif. Ce type de réseau neuronal artificiel est couramment utilisé pour l'analyse sur des images, mais il peut également être utilisé dans d'autres situations.

source: The following 15-minute video from Michael Pound at the University of Nottingham may be a good place to start exploring the topic. It also points to other simple videos if you are still curious or confused.
fr: La vidéo de 15 minutes de Michael Pound à l'université de Nottingham peut être un bon point de départ pour explorer le sujet. Elle pointe également vers d'autres vidéos simples si vous êtes encore curieux ou confus.

source: This Web application uses the open-source API TensorFlow Object Detection developed by Google Brain for its calculations. TensorFlow is a powerful tool you can use to implement machine learning techniques without building everything from scratch. If you want to learn how the different components of a neural network interact, visit the awesome TensorFlow Playground, and play with all the parameters of a network to see how it affects predictions. Take a look at it
fr: Cette application Web utilise pour ses calculs l'API open source TensorFlow Object Detection développée par Google Brain. TensorFlow est un outil puissant que l'on peut utiliser pour implémenter des techniques d'apprentissage automatique sans tout construire à partir de zéro. Si vous voulez apprendre comment les différents composants d'un réseau de neurones interagissent, visitez l'impressionnant TensorFlow Playground et jouez avec tous les paramètres d'un réseau pour voir comment ça affecte les prédictions. Jetez un coup d'œil

source: here
fr: ici

source: I assembled this Web application by adapting the model produced by the work of Tadej Magajna. That model itself is an adaptation of the Faster-RCNN-Inception-V2 model retrained on images of Wally. Take a look at his work
fr: J'ai assemblé cette application Web en adaptant le modèle produit par le travail de Tadej Magajna. Ce modèle lui-même est une adaptation du modèle Faster-RCNN-Inception-V2 rentraîné sur des images de Charlie. Jetez un coup d'œil à son travail

source: If you are interested, I uploaded some of the important files for this project on my GitHub page
fr: Si vous êtes intéressé, j'ai téléchargé certains des fichiers importants pour ce projet sur ma page GitHub

source: Take care,
fr: Tenez bon,
